Project 3
========================
1 - *For your database, you should download and install the appropriate version
of the Chinook database for your RDBMS, which is available here, under the
downloads tab: https://chinookdatabase.codeplex.com/*
Download can now be found here: https://github.com/lerocha/chinook-database/tree/master/ChinookDatabase/DataSources

In [4]:
#import pandas and numpy
import numpy as np
import pandas as pd
import sqlite3

**Connect to the SQL Lite Database - RDMS**

In [5]:
connection = sqlite3.connect("Chinook_Sqlite.sqlite")

Your task is to create a pandas DataFrame that displays Customers’ Last
Name and First Name, and each customer’s purchased Track names and
Album Titles.
The information should be sorted by Customer LastName then Customer FirstName.

In [6]:
#Using Inner Joins since we only want data that is available on both tables
query = '''SELECT customer.firstname, customer.lastname, track.name, album.Title
                              FROM customer
                              INNER JOIN invoice ON customer.CustomerID = invoice.CustomerID
                              INNER JOIN invoiceline ON invoiceline.invoiceID = invoice.invoiceID
                              INNER JOIN track ON invoiceline.trackID = track.trackID
                              INNER JOIN album ON album.albumid = track.albumid
                              ORDER BY customer.LastName, customer.Firstname'''
results = pd.read_sql(query, connection)
results

,FirstName,LastName,Name,Title
0,Roberto,Almeida,Right Next Door to Hell,Use Your Illusion I
1,Roberto,Almeida,In The Evening,In Through The Out Door
2,Roberto,Almeida,Fool In The Rain,In Through The Out Door
3,Roberto,Almeida,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Roberto,Almeida,Caso Você Queira Saber,Minas
...,...,...,...,...
2235,Fynn,Zimmermann,Nothin' To Lose,Unplugged [Live]
2236,Fynn,Zimmermann,Since I've Been Loving You,BBC Sessions [Disc 2] [Live]
2237,Fynn,Zimmermann,Going To California,BBC Sessions [Disc 2] [Live]
2238,Fynn,Zimmermann,We're Gonna Groove,Coda
2239,Fynn,Zimmermann,Ozone Baby,Coda

The first five rows of results should look the assingment:

In [7]:
results.head()

,FirstName,LastName,Name,Title
0,Roberto,Almeida,Right Next Door to Hell,Use Your Illusion I
1,Roberto,Almeida,In The Evening,In Through The Out Door
2,Roberto,Almeida,Fool In The Rain,In Through The Out Door
3,Roberto,Almeida,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Roberto,Almeida,Caso Você Queira Saber,Minas